EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet/inputs/foam_base/foam_base_ASJet/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "60000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
4520
(
0.00091676277
0.00071297572
0.00057119451
0.00048766162
0.0004201591
0.0003882615
0.00036190462
0.00036358489
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0011;
        value           uniform 0.0011;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
24
(
0.13996021
0.017097303
0.014150196
0.032028999
0.055267241
0.087320196
0.14072476
0.23618446
...
)
;
    }
    inflow1
    {
        type            inletOutlet;
        inletValue      uniform 0.0011;
        value           uniform 0.0011;
    }
    wall2
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
15
(
0.029692553
0.003440151
0.0024190052
0.002588887
0.0037290879
0.0062515868
0.015610488
0.004022936
0.00062625937
0.0055445899
0.02274731
0.073796799
0.25028148
0.51511062
2.0278251
)
;
    }
    inflow2
    {
        type            inletOutlet;
        inletValue      uniform 0.0011;
        value           uniform 0.0011;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall3
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 8(1014.7867 969.73187 911.38038 834.52248 734.08622 607.62769 460.85149 312.66508);
    }
}


// ************************************************************************* //
