EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet/inputs/foam_base/foam_base_ASJet/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "60000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
4520
(
1.3941863e-07
1.3391515e-07
1.2695315e-07
1.251243e-07
1.1993734e-07
1.2128102e-07
1.1899791e-07
1.2392488e-07
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.4502881e-07;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            nutUSpaldingWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
24
(
4.700111e-09
9.7906883e-10
8.537545e-10
1.6375026e-09
2.4969448e-09
3.4638074e-09
4.7923181e-09
6.7509034e-09
...
)
;
    }
    inflow1
    {
        type            calculated;
        value           uniform 1.4502881e-07;
    }
    wall2
    {
        type            nutUSpaldingWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
15
(
3.8112552e-08
6.5793795e-09
5.2228911e-09
5.5536167e-09
7.4087741e-09
1.1261117e-08
2.3235302e-08
6.684946e-09
1.143617e-09
8.6776704e-09
2.7750287e-08
7.3310767e-08
2.1544921e-07
4.0139339e-07
2.2552396e-06
)
;
    }
    inflow2
    {
        type            calculated;
        value           uniform 1.4502881e-07;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
56
(
0.22759305
0.22759607
0.22761103
0.22763962
0.22768362
0.22774503
0.22782606
0.22792917
...
)
;
    }
    wall3
    {
        type            nutUSpaldingWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 8(0.00027309886 0.00026025633 0.00024650368 0.00023070124 0.00021207571 0.0001890951 0.00016229069 0.00013384111);
    }
}


// ************************************************************************* //
