EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet/inputs/foam_base/foam_base_ASJet/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "60000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
4520
(
6575.6115
5324.0855
4499.2543
3897.4175
3503.155
3201.3378
3041.2686
2933.9137
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 7584.7;
        value           uniform 7584.7;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        blended         1;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
24
(
7427600.8
6907346.5
6499523.9
6346092
6407069.7
6644614.7
7038453.7
7577629.6
...
)
;
    }
    inflow1
    {
        type            inletOutlet;
        inletValue      uniform 7584.7;
        value           uniform 7584.7;
    }
    wall2
    {
        blended         1;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
15
(
115639.62
113899.94
112471.28
111135.48
109866.59
108553.5
107259.98
130949.95
131869.55
126248.31
121983.93
119261.45
118582.17
119354.37
129977.05
)
;
    }
    inflow2
    {
        type            inletOutlet;
        inletValue      uniform 7584.7;
        value           uniform 7584.7;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall3
    {
        blended         1;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 8(84363.948 83829.029 82241.433 79353.269 74725.38 68200.602 59518.963 49098.969);
    }
}


// ************************************************************************* //
