EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet/inputs/foam_base/foam_base_ASJet/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
type sets;
setFormat raw;

// Surface output format. Choice of
//      null        : suppress output
//      foamFile    : separate points, faces and values file
//      dx          : DX scalar or vector format
//      vtk         : VTK ascii format
//      raw         : x y z value format for use with e.g. gnuplot 'splot'.
//
// Note:
// other formats such as obj, stl, etc can also be written (by proxy)
// but without any values!
surfaceFormat vtk;

// interpolationScheme. choice of
//      cell          : use cell-centre value only; constant over cells (default)
//      cellPoint     : use cell-centre and vertex values
//      cellPointFace : use cell-centre, vertex and face values.
// 1] vertex values determined from neighbouring cell-centre values
// 2] face values determined using the current face interpolation scheme
//    for the field (linear, gamma, etc.)
interpolationScheme cellPoint;

// Fields to sample.
fields
(
    //UDNS
    U
    //k
    //turbulenceProperties:R
    //wallShearStress
    //divTau_Breuer
    //divTau_IC
    //TauDNS_Breuer
);

// Set sampling definition: choice of
//      uniform             evenly distributed points on line
//      face                one point per face intersection
//      midPoint            one point per cell, in between two face intersections
//      midPoint     combination of face and midPoint
//
//      curve               specified points, not nessecary on line, uses
//                          tracking
//      cloud               specified points, uses findCell
//
// axis: how to write point coordinate. Choice of
// - x/y/z: x/y/z coordinate only
// - xyz: three columns
//  (probably does not make sense for anything but raw)
// - distance: distance from start of sampling line (if uses line) or
//             distance from first specified sampling point
//
// type specific:
//      uniform, face, midPoint, midPoint : start and end coordinate
//      uniform: extra number of sampling points
//      curve, cloud: list of coordinates
sets
(
    line_jet_exit
    {
        type        uniform;
        axis        z;
        start       (0 0 0);
        end         (0 0 0.0254);
        nPoints     100;
    }

    line_center
    {
        type        cloud;
        axis        x;
        points      
    (
        (0.0508	0	0	)
        (0.05588	0	0	)
        (0.06096	0	0	)
        (0.06604	0	0	)
        (0.07112	0	0	)
        (0.0762	0	0	)
        (0.08128	0	0	)
        (0.08636	0	0	)
        (0.09144	0	0	)
        (0.09652	0	0	)
        (0.1016	0	0	)
        (0.10668	0	0	)
        (0.11176	0	0	)
        (0.11684	0	0	)
        (0.12192	0	0	)
        (0.127	0	0	)
        (0.13208	0	0	)
        (0.13716	0	0	)
        (0.14224	0	0	)
        (0.14732	0	0	)
        (0.1524	0	0	)
        (0.15748	0	0	)
        (0.16256	0	0	)
        (0.16764	0	0	)
        (0.17272	0	0	)
        (0.1778	0	0	)
        (0.18288	0	0	)
        (0.18796	0	0	)
        (0.19304	0	0	)
        (0.19812	0	0	)
        (0.2032	0	0	)
        (0.20828	0	0	)
        (0.21336	0	0	)
        (0.21844	0	0	)
        (0.22352	0	0	)
        (0.2286	0	0	)
        (0.23368	0	0	)
        (0.23876	0	0	)
        (0.24384	0	0	)
        (0.24892	0	0	)
        (0.254	0	0	)
        (0.25908	0	0	)
        (0.26416	0	0	)
        (0.26924	0	0	)
        (0.27432	0	0	)
        (0.2794	0	0	)
        (0.28448	0	0	)
        (0.28956	0	0	)
        (0.29464	0	0	)
        (0.29972	0	0	)
        (0.3048	0	0	)
        (0.30988	0	0	)
        (0.31496	0	0	)
        (0.32004	0	0	)
        (0.32512	0	0	)
        (0.3302	0	0	)
        (0.33528	0	0	)
        (0.34036	0	0	)
        (0.34544	0	0	)
        (0.35052	0	0	)
        (0.3556	0	0	)
        (0.36068	0	0	)
        (0.36576	0	0	)
        (0.37084	0	0	)
        (0.37592	0	0	)
        (0.381	0	0	)
        (0.38608	0	0	)
        (0.39116	0	0	)
        (0.39624	0	0	)
        (0.40132	0	0	)
        (0.4064	0	0	)
        (0.41148	0	0	)
        (0.41656	0	0	)
        (0.42164	0	0	)
        (0.42672	0	0	)
        (0.4318	0	0	)
        (0.43688	0	0	)
        (0.44196	0	0	)
        (0.44704	0	0	)
        (0.45212	0	0	)
        (0.4572	0	0	)
        (0.46228	0	0	)
        (0.46736	0	0	)
        (0.47244	0	0	)
        (0.47752	0	0	)
        (0.4826	0	0	)
        (0.48768	0	0	)
        (0.49276	0	0	)
        (0.49784	0	0	)
        (0.50292	0	0	)
        (0.508	0	0	)
        (0.51308	0	0	)
        (0.51816	0	0	)
        (0.52324	0	0	)
        (0.52832	0	0	)
        (0.5334	0	0	)
        (0.53848	0	0	)
        (0.54356	0	0	)
        (0.54864	0	0	)
        (0.55372	0	0	)
        (0.5588	0	0	)
        (0.56388	0	0	)
        (0.56896	0	0	)
        (0.57404	0	0	)
        (0.57912	0	0	)
        (0.5842	0	0	)
        (0.58928	0	0	)
        (0.59436	0	0	)
        (0.59944	0	0	)
        (0.60452	0	0	)
        (0.6096	0	0	)
        (0.61468	0	0	)
        (0.61976	0	0	)
        (0.62484	0	0	)
        (0.62992	0	0	)
        (0.635	0	0	)
        (0.64008	0	0	)
        (0.64516	0	0	)
        (0.65024	0	0	)
        (0.65532	0	0	)
        (0.6604	0	0	)
        (0.66548	0	0	)
        (0.67056	0	0	)
        (0.67564	0	0	)
        (0.68072	0	0	)
        (0.6858	0	0	)
        (0.69088	0	0	)
        (0.69596	0	0	)
        (0.70104	0	0	)
        (0.70612	0	0	)
        (0.7112	0	0	)
        (0.71628	0	0	)
        (0.72136	0	0	)
        (0.72644	0	0	)
        (0.73152	0	0	)
        (0.7366	0	0	)
        (0.74168	0	0	)
        (0.74676	0	0	)
        (0.75184	0	0	)
        (0.75692	0	0	)
        (0.762	0	0	)
        (0.76708	0	0	)
        (0.77216	0	0	)
        (0.77724	0	0	)
        (0.78232	0	0	)
        (0.7874	0	0	)
        (0.79248	0	0	)
        (0.79756	0	0	)
        (0.80264	0	0	)
        (0.80772	0	0	)
        (0.8128	0	0	)
        (0.81788	0	0	)
        (0.82296	0	0	)
        (0.82804	0	0	)
        (0.83312	0	0	)
        (0.8382	0	0	)
        (0.84328	0	0	)
        (0.84836	0	0	)
        (0.85344	0	0	)
        (0.85852	0	0	)
        (0.8636	0	0	)
        (0.86868	0	0	)
        (0.87376	0	0	)
        (0.87884	0	0	)
        (0.88392	0	0	)
        (0.889	0	0	)
        (0.89408	0	0	)
        (0.89916	0	0	)
        (0.90424	0	0	)
        (0.90932	0	0	)
        (0.9144	0	0	)
        (0.91948	0	0	)
        (0.92456	0	0	)
        (0.92964	0	0	)
        (0.93472	0	0	)
        (0.9398	0	0	)
        (0.94488	0	0	)
        (0.94996	0	0	)
        (0.95504	0	0	)
        (0.96012	0	0	)
        (0.9652	0	0	)
        (0.97028	0	0	)
        (0.97536	0	0	)
        (0.98044	0	0	)
        (0.98552	0	0	)
        (0.9906	0	0	)
        (0.99568	0	0	)
        (1.00076	0	0	)
        (1.00584	0	0	)
        (1.01092	0	0	)
        (1.016	0	0	)
        (1.02108	0	0	)
        (1.02616	0	0	)
        (1.03124	0	0	)
        (1.03632	0	0	)
        (1.0414	0	0	)
        (1.04648	0	0	)
        (1.05156	0	0	)
        (1.05664	0	0	)
        (1.06172	0	0	)
        (1.0668	0	0	)
        (1.07188	0	0	)
        (1.07696	0	0	)
        (1.08204	0	0	)
        (1.08712	0	0	)
        (1.0922	0	0	)
        (1.09728	0	0	)
        (1.10236	0	0	)
        (1.10744	0	0	)
        (1.11252	0	0	)
        (1.1176	0	0	)
        (1.12268	0	0	)
        (1.12776	0	0	)
        (1.13284	0	0	)
        (1.13792	0	0	)
        (1.143	0	0	)
        (1.14808	0	0	)
        (1.15316	0	0	)
        (1.15824	0	0	)
        (1.16332	0	0	)
        (1.1684	0	0	)
        (1.17348	0	0	)
        (1.17856	0	0	)
        (1.18364	0	0	)
        (1.18872	0	0	)
        (1.1938	0	0	)
        (1.19888	0	0	)
        (1.20396	0	0	)
        (1.20904	0	0	)
        (1.21412	0	0	)
        (1.2192	0	0	)
        (1.22428	0	0	)
        (1.22936	0	0	)
        (1.23444	0	0	)
        (1.23952	0	0	)
        (1.2446	0	0	)
        (1.24968	0	0	)
        (1.25476	0	0	)
        (1.25984	0	0	)
        (1.26492	0	0	)
        (1.27	0	0	)
    );
    }

    line_x_2
    {
        type        cloud;
        axis        z;
        points      
    (
        (0.1016	0	7.63016e-09	)
        (0.1016	0	0.001016	)
        (0.1016	0	0.002032	)
        (0.1016	0	0.003048	)
        (0.1016	0	0.004064	)
        (0.1016	0	0.00508	)
        (0.1016	0	0.006096	)
        (0.1016	0	0.007112	)
        (0.1016	0	0.008128	)
        (0.1016	0	0.009144	)
        (0.1016	0	0.01016	)
        (0.1016	0	0.011176	)
        (0.1016	0	0.012192	)
        (0.1016	0	0.013208	)
        (0.1016	0	0.014224	)
        (0.1016	0	0.01524	)
        (0.1016	0	0.016256	)
        (0.1016	0	0.017272	)
        (0.1016	0	0.018288	)
        (0.1016	0	0.019304	)
        (0.1016	0	0.02032	)
        (0.1016	0	0.021336	)
        (0.1016	0	0.022352	)
        (0.1016	0	0.023368	)
        (0.1016	0	0.024384	)
        (0.1016	0	0.0254	)
        (0.1016	0	0.026416	)
        (0.1016	0	0.027432	)
        (0.1016	0	0.028448	)
        (0.1016	0	0.029464	)
        (0.1016	0	0.03048	)
        (0.1016	0	0.031496	)
        (0.1016	0	0.032512	)
        (0.1016	0	0.033528	)
        (0.1016	0	0.034544	)
        (0.1016	0	0.03556	)
        (0.1016	0	0.036576	)
        (0.1016	0	0.037592	)
        (0.1016	0	0.038608	)
        (0.1016	0	0.039624	)
        (0.1016	0	0.04064	)
        (0.1016	0	0.041656	)
        (0.1016	0	0.042672	)
        (0.1016	0	0.043688	)
        (0.1016	0	0.044704	)
        (0.1016	0	0.04572	)
        (0.1016	0	0.046736	)
        (0.1016	0	0.047752	)
        (0.1016	0	0.048768	)
        (0.1016	0	0.049784	)
        (0.1016	0	0.0508	)
        (0.1016	0	0.051816	)
        (0.1016	0	0.052832	)
        (0.1016	0	0.053848	)
        (0.1016	0	0.054864	)
        (0.1016	0	0.05588	)
        (0.1016	0	0.056896	)
        (0.1016	0	0.057912	)
        (0.1016	0	0.058928	)
        (0.1016	0	0.059944	)
        (0.1016	0	0.06096	)
        (0.1016	0	0.061976	)
        (0.1016	0	0.062992	)
        (0.1016	0	0.064008	)
        (0.1016	0	0.065024	)
        (0.1016	0	0.06604	)
        (0.1016	0	0.067056	)
        (0.1016	0	0.068072	)
        (0.1016	0	0.069088	)
        (0.1016	0	0.070104	)
    );
    }

    line_x_5
    {
        type        cloud;
        axis        z;
        points      
    (
        (0.254	0	7.63016e-09	)
        (0.254	0	0.001016	)
        (0.254	0	0.002032	)
        (0.254	0	0.003048	)
        (0.254	0	0.004064	)
        (0.254	0	0.00508	)
        (0.254	0	0.006096	)
        (0.254	0	0.007112	)
        (0.254	0	0.008128	)
        (0.254	0	0.009144	)
        (0.254	0	0.01016	)
        (0.254	0	0.011176	)
        (0.254	0	0.012192	)
        (0.254	0	0.013208	)
        (0.254	0	0.014224	)
        (0.254	0	0.01524	)
        (0.254	0	0.016256	)
        (0.254	0	0.017272	)
        (0.254	0	0.018288	)
        (0.254	0	0.019304	)
        (0.254	0	0.02032	)
        (0.254	0	0.021336	)
        (0.254	0	0.022352	)
        (0.254	0	0.023368	)
        (0.254	0	0.024384	)
        (0.254	0	0.0254	)
        (0.254	0	0.026416	)
        (0.254	0	0.027432	)
        (0.254	0	0.028448	)
        (0.254	0	0.029464	)
        (0.254	0	0.03048	)
        (0.254	0	0.031496	)
        (0.254	0	0.032512	)
        (0.254	0	0.033528	)
        (0.254	0	0.034544	)
        (0.254	0	0.03556	)
        (0.254	0	0.036576	)
        (0.254	0	0.037592	)
        (0.254	0	0.038608	)
        (0.254	0	0.039624	)
        (0.254	0	0.04064	)
        (0.254	0	0.041656	)
        (0.254	0	0.042672	)
        (0.254	0	0.043688	)
        (0.254	0	0.044704	)
        (0.254	0	0.04572	)
        (0.254	0	0.046736	)
        (0.254	0	0.047752	)
        (0.254	0	0.048768	)
        (0.254	0	0.049784	)
        (0.254	0	0.0508	)
        (0.254	0	0.051816	)
        (0.254	0	0.052832	)
        (0.254	0	0.053848	)
        (0.254	0	0.054864	)
        (0.254	0	0.05588	)
        (0.254	0	0.056896	)
        (0.254	0	0.057912	)
        (0.254	0	0.058928	)
        (0.254	0	0.059944	)
        (0.254	0	0.06096	)
        (0.254	0	0.061976	)
        (0.254	0	0.062992	)
        (0.254	0	0.064008	)
        (0.254	0	0.065024	)
        (0.254	0	0.06604	)
        (0.254	0	0.067056	)
        (0.254	0	0.068072	)
        (0.254	0	0.069088	)
        (0.254	0	0.070104	)
    );
    }

    line_x_10
    {
        type        cloud;
        axis        z;
        points      
    (
        (0.508	0	7.63016e-09	)
        (0.508	0	0.001016	)
        (0.508	0	0.002032	)
        (0.508	0	0.003048	)
        (0.508	0	0.004064	)
        (0.508	0	0.00508	)
        (0.508	0	0.006096	)
        (0.508	0	0.007112	)
        (0.508	0	0.008128	)
        (0.508	0	0.009144	)
        (0.508	0	0.01016	)
        (0.508	0	0.011176	)
        (0.508	0	0.012192	)
        (0.508	0	0.013208	)
        (0.508	0	0.014224	)
        (0.508	0	0.01524	)
        (0.508	0	0.016256	)
        (0.508	0	0.017272	)
        (0.508	0	0.018288	)
        (0.508	0	0.019304	)
        (0.508	0	0.02032	)
        (0.508	0	0.021336	)
        (0.508	0	0.022352	)
        (0.508	0	0.023368	)
        (0.508	0	0.024384	)
        (0.508	0	0.0254	)
        (0.508	0	0.026416	)
        (0.508	0	0.027432	)
        (0.508	0	0.028448	)
        (0.508	0	0.029464	)
        (0.508	0	0.03048	)
        (0.508	0	0.031496	)
        (0.508	0	0.032512	)
        (0.508	0	0.033528	)
        (0.508	0	0.034544	)
        (0.508	0	0.03556	)
        (0.508	0	0.036576	)
        (0.508	0	0.037592	)
        (0.508	0	0.038608	)
        (0.508	0	0.039624	)
        (0.508	0	0.04064	)
        (0.508	0	0.041656	)
        (0.508	0	0.042672	)
        (0.508	0	0.043688	)
        (0.508	0	0.044704	)
        (0.508	0	0.04572	)
        (0.508	0	0.046736	)
        (0.508	0	0.047752	)
        (0.508	0	0.048768	)
        (0.508	0	0.049784	)
        (0.508	0	0.0508	)
        (0.508	0	0.051816	)
        (0.508	0	0.052832	)
        (0.508	0	0.053848	)
        (0.508	0	0.054864	)
        (0.508	0	0.05588	)
        (0.508	0	0.056896	)
        (0.508	0	0.057912	)
        (0.508	0	0.058928	)
        (0.508	0	0.059944	)
        (0.508	0	0.06096	)
        (0.508	0	0.061976	)
        (0.508	0	0.062992	)
        (0.508	0	0.064008	)
        (0.508	0	0.065024	)
        (0.508	0	0.06604	)
        (0.508	0	0.067056	)
        (0.508	0	0.068072	)
        (0.508	0	0.069088	)
        (0.508	0	0.070104	)
    );
    }

    line_x_15
    {
        type        cloud;
        axis        z;
        points      
    (
        (0.762	0	7.63016e-09	)
        (0.762	0	0.001016	)
        (0.762	0	0.002032	)
        (0.762	0	0.003048	)
        (0.762	0	0.004064	)
        (0.762	0	0.00508	)
        (0.762	0	0.006096	)
        (0.762	0	0.007112	)
        (0.762	0	0.008128	)
        (0.762	0	0.009144	)
        (0.762	0	0.01016	)
        (0.762	0	0.011176	)
        (0.762	0	0.012192	)
        (0.762	0	0.013208	)
        (0.762	0	0.014224	)
        (0.762	0	0.01524	)
        (0.762	0	0.016256	)
        (0.762	0	0.017272	)
        (0.762	0	0.018288	)
        (0.762	0	0.019304	)
        (0.762	0	0.02032	)
        (0.762	0	0.021336	)
        (0.762	0	0.022352	)
        (0.762	0	0.023368	)
        (0.762	0	0.024384	)
        (0.762	0	0.0254	)
        (0.762	0	0.026416	)
        (0.762	0	0.027432	)
        (0.762	0	0.028448	)
        (0.762	0	0.029464	)
        (0.762	0	0.03048	)
        (0.762	0	0.031496	)
        (0.762	0	0.032512	)
        (0.762	0	0.033528	)
        (0.762	0	0.034544	)
        (0.762	0	0.03556	)
        (0.762	0	0.036576	)
        (0.762	0	0.037592	)
        (0.762	0	0.038608	)
        (0.762	0	0.039624	)
        (0.762	0	0.04064	)
        (0.762	0	0.041656	)
        (0.762	0	0.042672	)
        (0.762	0	0.043688	)
        (0.762	0	0.044704	)
        (0.762	0	0.04572	)
        (0.762	0	0.046736	)
        (0.762	0	0.047752	)
        (0.762	0	0.048768	)
        (0.762	0	0.049784	)
        (0.762	0	0.0508	)
        (0.762	0	0.051816	)
        (0.762	0	0.052832	)
        (0.762	0	0.053848	)
        (0.762	0	0.054864	)
        (0.762	0	0.05588	)
        (0.762	0	0.056896	)
        (0.762	0	0.057912	)
        (0.762	0	0.058928	)
        (0.762	0	0.059944	)
        (0.762	0	0.06096	)
        (0.762	0	0.061976	)
        (0.762	0	0.062992	)
        (0.762	0	0.064008	)
        (0.762	0	0.065024	)
        (0.762	0	0.06604	)
        (0.762	0	0.067056	)
        (0.762	0	0.068072	)
        (0.762	0	0.069088	)
        (0.762	0	0.070104	)
    );
    }

    line_x_20
    {
        type        cloud;
        axis        z;
        points      
    (
        (1.016	0	7.63016e-09	)
        (1.016	0	0.001016	)
        (1.016	0	0.002032	)
        (1.016	0	0.003048	)
        (1.016	0	0.004064	)
        (1.016	0	0.00508	)
        (1.016	0	0.006096	)
        (1.016	0	0.007112	)
        (1.016	0	0.008128	)
        (1.016	0	0.009144	)
        (1.016	0	0.01016	)
        (1.016	0	0.011176	)
        (1.016	0	0.012192	)
        (1.016	0	0.013208	)
        (1.016	0	0.014224	)
        (1.016	0	0.01524	)
        (1.016	0	0.016256	)
        (1.016	0	0.017272	)
        (1.016	0	0.018288	)
        (1.016	0	0.019304	)
        (1.016	0	0.02032	)
        (1.016	0	0.021336	)
        (1.016	0	0.022352	)
        (1.016	0	0.023368	)
        (1.016	0	0.024384	)
        (1.016	0	0.0254	)
        (1.016	0	0.026416	)
        (1.016	0	0.027432	)
        (1.016	0	0.028448	)
        (1.016	0	0.029464	)
        (1.016	0	0.03048	)
        (1.016	0	0.031496	)
        (1.016	0	0.032512	)
        (1.016	0	0.033528	)
        (1.016	0	0.034544	)
        (1.016	0	0.03556	)
        (1.016	0	0.036576	)
        (1.016	0	0.037592	)
        (1.016	0	0.038608	)
        (1.016	0	0.039624	)
        (1.016	0	0.04064	)
        (1.016	0	0.041656	)
        (1.016	0	0.042672	)
        (1.016	0	0.043688	)
        (1.016	0	0.044704	)
        (1.016	0	0.04572	)
        (1.016	0	0.046736	)
        (1.016	0	0.047752	)
        (1.016	0	0.048768	)
        (1.016	0	0.049784	)
        (1.016	0	0.0508	)
        (1.016	0	0.051816	)
        (1.016	0	0.052832	)
        (1.016	0	0.053848	)
        (1.016	0	0.054864	)
        (1.016	0	0.05588	)
        (1.016	0	0.056896	)
        (1.016	0	0.057912	)
        (1.016	0	0.058928	)
        (1.016	0	0.059944	)
        (1.016	0	0.06096	)
        (1.016	0	0.061976	)
        (1.016	0	0.062992	)
        (1.016	0	0.064008	)
        (1.016	0	0.065024	)
        (1.016	0	0.06604	)
        (1.016	0	0.067056	)
        (1.016	0	0.068072	)
        (1.016	0	0.069088	)
        (1.016	0	0.070104	)
    );
    }
);

// Surface sampling definition: choice of
//      plane : values on plane defined by point, normal.
//      patch : values on patch.
//
// 1] patches are not triangulated by default
// 2] planes are always triangulated
// 3] iso-surfaces are always triangulated
surfaces
(

);

// *********************************************************************** //
